[metadata]
creation_date = "2024/02/09"
maturity = "experimental"
sigma = "proc_creation_win_imewbdld_download.yml"

[splunk]
query = '''
| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where 
Processes.process_path="*\\IMEWDBLD.exe" OR Processes.original_file_name="imewdbld.exe" Processes.process IN ("*http://*", "*https://*")
by Processes.process_name Processes.process_path Processes.process Processes.parent_process_exec Processes.parent_process Processes.dest Processes.user 
| `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
'''
impact = "medium"
urgency = "high"

[rule]
author = ["lazarg","Swachchhanda Shrawan Poudel"]
description = "Detects usage of \"IMEWDBLD.exe\" to download arbitrary files."
from = "now-6m"
name = "Arbitrary File Download Via IMEWDBLD.EXE"
risk_score = 73
severity = "high"
index = ["logs-*"]
type = "eql"
rule_id = "6e766fea-b290-4771-985f-94e64a041725"
tags = [
    "BC-DaC"
]
language= "eql"
query = '''
process where host.os.type == "windows" and event.type == "start" and (process.executable:"*\\IMEWDBLD.exe" or process.pe.original_file_name:"imewdbld.exe") and (process.command_line like~ ("*http://*", "*https://*"))
'''
false_positives = ["Unknown"]
note = """
- Determine which processes, parent processes, files, and devices are involved with the alert.
- Examine the device logs at the time of the alert, and look for any that show IMEWDBLD.exe being used for file downloads.
- Investigate the reputation of the destination IP address.
- Conduct a comprehensive analysis of the downloaded file using both static and dynamic investigation techniques.
- Investigate whether the activity can be linked to a valid workflow.
- If a suspicious circumstance is detected based on the above, and its source is not a known, valid activity, the alert must be escalated.
"""

references = ["https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1105/T1105.md","https://lolbas-project.github.io/lolbas/Binaries/IMEWDBLD/"]

[rule.investigation_fields]
field_names = ["process.command_line","process.executable","process.pe.original_file_name","host.hostname","user.name"]

[rule.alert_suppression]
group_by = ["host.name"]
missing_fields_strategy = "doNotSuppress"

[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
id = "TA0011"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"

[[rule.threat.technique]]
id = "T1105"
name = "Ingress Tool Transfer"
reference = "https://attack.mitre.org/techniques/T1105/"

[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[[rule.threat.technique]]
id = "T1218"
name = "System Binary Proxy Execution"
reference = "https://attack.mitre.org/techniques/T1218/"
