[metadata]
creation_date = "2024/09/30"
maturity = "experimental"
sigma="proc_creation_win_hktl_certipy.yml"

[splunk]
query = '''
| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where 
Processes.process_path="*\\Certipy.exe" OR Processes.original_file_name="Certipy.exe" OR Processes.Description="*Certipy*" OR (Processes.process IN ("* auth *", "* find *", "* forge *", "* relay *", "* req *", "* shadow *") Processes.process IN ("* -bloodhound*", "* -ca-pfx *", "* -dc-ip *", "* -kirbi*", "* -old-bloodhound*", "* -pfx *", "* -target*", "* -username *", "* -vulnerable*", "*auth -pfx*", "*shadow auto*", "*shadow list*"))
by Processes.process_name Processes.process_path Processes.process Processes.parent_process_exec Processes.parent_process Processes.dest Processes.user 
| `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
'''
impact = "medium"
urgency = "medium"

[rule]
author = ["lazarg","pH-T "]
description = "Detects Certipy a tool for Active Directory Certificate Services enumeration and abuse based on PE metadata characteristics and common command line arguments."
from = "now-6m"
name = "Certipy Execution"
risk_score = 47
severity = "medium"
index = ["logs-*"]
type = "eql"
rule_id = "600c2ecc-15fe-468b-bc27-c2e84a1b3879"
tags = [
    "BC-DaC"
]
language= "eql"
query = '''
process where host.os.type == "windows" and event.type == "start" and ((process.executable:"*\\Certipy.exe" or process.pe.original_file_name:"Certipy.exe" or process.pe.description:"*Certipy*") or ((process.command_line like~ ("* auth *", "* find *", "* forge *", "* relay *", "* req *", "* shadow *")) and (process.command_line like~ ("* -bloodhound*", "* -ca-pfx *", "* -dc-ip *", "* -kirbi*", "* -old-bloodhound*", "* -pfx *", "* -target*", "* -username *", "* -vulnerable*", "*auth -pfx*", "*shadow auto*", "*shadow list*"))))
'''
false_positives = ["Unknown"]
note = """
- Determine which processes, parent processes, and files are involved with the alert.
- Examine the commands run on the device at the time of the alert, and look for any that show suspicious Certipy tool execution.
- If a suspicious circumstance is detected based on the above, and its source is not a known, valid activity, the alert must be escalated.
"""

references = ["https://github.com/ly4k/Certipy"]

[rule.investigation_fields]
field_names=["process.command_line","process.executable","process.pe.original_file_name","process.pe.description","host.hostname","user.name"]

[rule.alert_suppression]
group_by = ["host.name"]
missing_fields_strategy = "doNotSuppress"

[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

[[rule.threat.technique]]
id = "T1649"
name = "Steal or Forge Authentication Certificates"
reference = "https://attack.mitre.org/techniques/T1649/"
