[metadata]
creation_date = "2024/02/15"
maturity = "experimental"
sigma = "proc_creation_win_ping_hex_ip.yml"

[splunk]
query = '''
| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where 
Processes.process_path="*\\ping.exe" Processes.process="*0x*" | table Processes.parent_process
by Processes.process_name Processes.process_path Processes.process Processes.parent_process_exec Processes.parent_process Processes.dest Processes.user 
| `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
'''
impact = "medium"
urgency = "high"

[rule]
author = ["lazarg","Florian Roth"]
description = "Detects a ping command that uses a hex encoded IP address."
from = "now-6m"
name = "Ping Hex IP"
risk_score = 73
severity = "high"
index = ["logs-*"]
type = "eql"
rule_id = "68aa7f9a-c447-4f26-b1fa-5b168e1c4576"
tags = [
    "BC-DaC"
]
language= "eql"
query = '''
process where host.os.type == "windows" and event.type == "start" and process.executable:"*\\ping.exe" and process.command_line:"*0x*"
'''
false_positives = ["Unlikely"]
note = '''
- Examine the commands executed on the device at the time of the alert, and look for any instances where ping is used with a HEX-formatted IP address.
- Investigate whether the activity can be associated with a valid workflow.
- If suspicious circumstances are observed based on the above, and the source cannot be attributed to known valid activity, the alert should be escalated.
'''

references = ["https://github.com/vysecurity/Aggressor-VYSEC/blob/0d61c80387b9432dab64b8b8a9fb52d20cfef80e/ping.cna","https://twitter.com/vysecurity/status/977198418354491392"]

[rule.investigation_fields]
field_names = ["process.command_line","process.executable","process.pe.original_file_name","process.pe.imphash","host.hostname","user.name"]

[rule.alert_suppression]
group_by = ["host.name"]
missing_fields_strategy = "doNotSuppress"

[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[[rule.threat.technique]]
id = "T1140"
name = "Deobfuscate/Decode Files or Information"
reference = "https://attack.mitre.org/techniques/T1140/"

[[rule.threat.technique]]
id = "T1027"
name = "Obfuscated Files or Information"
reference = "https://attack.mitre.org/techniques/T1027/"






